jmeter/admin-gateway/equipment/attachment_create.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Data creation">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Data creation thread group - Damper">
        <intProp name="ThreadGroup.num_threads">1000</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">25</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create data HTTP Request">
          <stringProp name="HTTPSampler.domain">admin.shooter.local</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/equipment/attachments</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;enabled&quot;: true,&#xd;
  &quot;name&quot;: &quot;Ammunition_${__UUID()}&quot;,&#xd;
  &quot;type&quot;: &quot;DAMPER&quot;,&#xd;
  &quot;effect&quot;: {&#xd;
    &quot;soundLoudnessRate&quot;: 0,&#xd;
    &quot;maxZoomRate&quot;: 0,&#xd;
    &quot;blowBackRate&quot;: ${rnd},&#xd;
    &quot;laserMaxDistanceMeters&quot;: 0,&#xd;
    &quot;bulletSpeedRate&quot;: 0&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJmRFpSLWpXakNBWGVqQnBzM0xJaV96Y0FRalNlTC14UGU1bHhjOE5HVVNBIn0.eyJleHAiOjE3NzI1NTc3MjIsImlhdCI6MTc3MjU1NDEyMiwiYXV0aF90aW1lIjoxNzcyNTUzNTk5LCJqdGkiOiJvbnJ0cnQ6NDU0MGZhNTctNTcyNy03NDViLTViYWMtMzMxMDFjMDg5MDFjIiwiaXNzIjoiaHR0cDovL2hvc3QuZG9ja2VyLmludGVybmFsOjc3NzgvcmVhbG1zL3Nob290ZXItYWRtaW4iLCJhdWQiOiJhY2NvdW50Iiwic3ViIjoiODQyZWIwYWYtYTBkYS00YjM3LWIwODAtYjk0NmI2NWQ2MWMxIiwidHlwIjoiQmVhcmVyIiwiYXpwIjoic2hvb3Rlci1hZG1pbiIsInNpZCI6ImFiOWFjNGY5LThiYWYtYjI2YS01NWExLTk0MDg1M2YxNGEyNSIsImFjciI6IjEiLCJhbGxvd2VkLW9yaWdpbnMiOlsiLyoiXSwicmVhbG1fYWNjZXNzIjp7InJvbGVzIjpbImRlZmF1bHQtcm9sZXMtc2hvb3Rlci1hZG1pbiIsIm9mZmxpbmVfYWNjZXNzIiwidW1hX2F1dGhvcml6YXRpb24iXX0sInJlc291cmNlX2FjY2VzcyI6eyJhY2NvdW50Ijp7InJvbGVzIjpbIm1hbmFnZS1hY2NvdW50IiwibWFuYWdlLWFjY291bnQtbGlua3MiLCJ2aWV3LXByb2ZpbGUiXX19LCJzY29wZSI6ImVtYWlsIHByb2ZpbGUiLCJlbWFpbF92ZXJpZmllZCI6dHJ1ZSwibmFtZSI6IkFkbWluIEFkbWluIiwicHJlZmVycmVkX3VzZXJuYW1lIjoiYWRtaW4xIiwiZ2l2ZW5fbmFtZSI6IkFkbWluIiwiZmFtaWx5X25hbWUiOiJBZG1pbiIsImVtYWlsIjoiYWRtaW4xQG1haWwucnUifQ.ilf9I3LbrWdnsAk-aIWEZl6MNQ4NWwQ-NYxqRA-AxxoWYcojPnGL0CYCRO7EoZOqcUkFEd7eq19wG9F2yFVRRD6W-jRrnQ65hnZPH_OzvWlo9eNV3xkkl-KZ7xnXrfuMEgL93TzTsxIpXVnrlMchhF9_JHtuQKV1MSEz6DrAiTt7K-8v-dy9tpGQDLIK-SgM1zdag8xPjfWolx6Ht_66nCDXYf71qmn6G9VwVuOTiUsVPfg1SK9jnHfIs1yAjWp5M9JUl7a3GhkE_LEhcJSR4MPV-H-yU98kXXPX82YKJMWWi7g8WNeCk6gfgXZQlnSU4NPG1dIOeRWhOnnJzBL8dg</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
            <intProp name="calcMode">0</intProp>
            <doubleProp>
              <name>throughput</name>
              <value>60.0</value>
              <savedValue>0.0</savedValue>
            </doubleProp>
          </ConstantThroughputTimer>
          <hashTree/>
          <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable">
            <stringProp name="maximumValue">-10</stringProp>
            <stringProp name="minimumValue">-60</stringProp>
            <boolProp name="perThread">true</boolProp>
            <stringProp name="variableName">rnd</stringProp>
          </RandomVariableConfig>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Data creation thread group - Suppressor">
        <intProp name="ThreadGroup.num_threads">1000</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">25</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create data HTTP Request">
          <stringProp name="HTTPSampler.domain">admin.shooter.local</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/equipment/attachments</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;enabled&quot;: true,&#xd;
  &quot;name&quot;: &quot;Ammunition_${__UUID()}&quot;,&#xd;
  &quot;type&quot;: &quot;SUPPRESSOR&quot;,&#xd;
  &quot;effect&quot;: {&#xd;
    &quot;soundLoudnessRate&quot;: ${rnd},&#xd;
    &quot;maxZoomRate&quot;: 0,&#xd;
    &quot;blowBackRate&quot;: 0,&#xd;
    &quot;laserMaxDistanceMeters&quot;: 0,&#xd;
    &quot;bulletSpeedRate&quot;: 0&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJmRFpSLWpXakNBWGVqQnBzM0xJaV96Y0FRalNlTC14UGU1bHhjOE5HVVNBIn0.eyJleHAiOjE3NzI1NTc3MjIsImlhdCI6MTc3MjU1NDEyMiwiYXV0aF90aW1lIjoxNzcyNTUzNTk5LCJqdGkiOiJvbnJ0cnQ6NDU0MGZhNTctNTcyNy03NDViLTViYWMtMzMxMDFjMDg5MDFjIiwiaXNzIjoiaHR0cDovL2hvc3QuZG9ja2VyLmludGVybmFsOjc3NzgvcmVhbG1zL3Nob290ZXItYWRtaW4iLCJhdWQiOiJhY2NvdW50Iiwic3ViIjoiODQyZWIwYWYtYTBkYS00YjM3LWIwODAtYjk0NmI2NWQ2MWMxIiwidHlwIjoiQmVhcmVyIiwiYXpwIjoic2hvb3Rlci1hZG1pbiIsInNpZCI6ImFiOWFjNGY5LThiYWYtYjI2YS01NWExLTk0MDg1M2YxNGEyNSIsImFjciI6IjEiLCJhbGxvd2VkLW9yaWdpbnMiOlsiLyoiXSwicmVhbG1fYWNjZXNzIjp7InJvbGVzIjpbImRlZmF1bHQtcm9sZXMtc2hvb3Rlci1hZG1pbiIsIm9mZmxpbmVfYWNjZXNzIiwidW1hX2F1dGhvcml6YXRpb24iXX0sInJlc291cmNlX2FjY2VzcyI6eyJhY2NvdW50Ijp7InJvbGVzIjpbIm1hbmFnZS1hY2NvdW50IiwibWFuYWdlLWFjY291bnQtbGlua3MiLCJ2aWV3LXByb2ZpbGUiXX19LCJzY29wZSI6ImVtYWlsIHByb2ZpbGUiLCJlbWFpbF92ZXJpZmllZCI6dHJ1ZSwibmFtZSI6IkFkbWluIEFkbWluIiwicHJlZmVycmVkX3VzZXJuYW1lIjoiYWRtaW4xIiwiZ2l2ZW5fbmFtZSI6IkFkbWluIiwiZmFtaWx5X25hbWUiOiJBZG1pbiIsImVtYWlsIjoiYWRtaW4xQG1haWwucnUifQ.ilf9I3LbrWdnsAk-aIWEZl6MNQ4NWwQ-NYxqRA-AxxoWYcojPnGL0CYCRO7EoZOqcUkFEd7eq19wG9F2yFVRRD6W-jRrnQ65hnZPH_OzvWlo9eNV3xkkl-KZ7xnXrfuMEgL93TzTsxIpXVnrlMchhF9_JHtuQKV1MSEz6DrAiTt7K-8v-dy9tpGQDLIK-SgM1zdag8xPjfWolx6Ht_66nCDXYf71qmn6G9VwVuOTiUsVPfg1SK9jnHfIs1yAjWp5M9JUl7a3GhkE_LEhcJSR4MPV-H-yU98kXXPX82YKJMWWi7g8WNeCk6gfgXZQlnSU4NPG1dIOeRWhOnnJzBL8dg</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
            <intProp name="calcMode">0</intProp>
            <doubleProp>
              <name>throughput</name>
              <value>60.0</value>
              <savedValue>0.0</savedValue>
            </doubleProp>
          </ConstantThroughputTimer>
          <hashTree/>
          <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable">
            <stringProp name="maximumValue">-10</stringProp>
            <stringProp name="minimumValue">-60</stringProp>
            <boolProp name="perThread">true</boolProp>
            <stringProp name="variableName">rnd</stringProp>
          </RandomVariableConfig>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>